###################################################################

# Created by write_sdc on Tue Dec  4 17:12:02 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_ideal_network [get_ports CLK]
create_clock [get_ports CLK]  -period 15  -waveform {0 7.5}
set_input_delay -clock CLK  -max 1  [get_ports RESET]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_inst_in[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[32]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[33]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[34]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[35]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[36]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[37]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[38]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[39]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[40]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[41]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[42]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[43]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[44]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[45]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[46]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[47]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[48]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[49]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[50]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[51]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[52]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[53]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[54]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[55]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[56]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[57]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[58]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[59]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[60]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[61]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[62]}]
set_input_delay -clock CLK  -max 1  [get_ports {node0_d_in[63]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_inst_in[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[32]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[33]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[34]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[35]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[36]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[37]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[38]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[39]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[40]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[41]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[42]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[43]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[44]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[45]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[46]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[47]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[48]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[49]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[50]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[51]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[52]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[53]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[54]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[55]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[56]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[57]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[58]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[59]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[60]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[61]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[62]}]
set_input_delay -clock CLK  -max 1  [get_ports {node1_d_in[63]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_inst_in[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[32]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[33]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[34]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[35]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[36]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[37]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[38]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[39]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[40]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[41]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[42]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[43]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[44]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[45]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[46]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[47]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[48]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[49]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[50]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[51]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[52]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[53]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[54]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[55]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[56]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[57]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[58]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[59]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[60]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[61]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[62]}]
set_input_delay -clock CLK  -max 1  [get_ports {node2_d_in[63]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_inst_in[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[32]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[33]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[34]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[35]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[36]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[37]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[38]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[39]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[40]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[41]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[42]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[43]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[44]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[45]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[46]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[47]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[48]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[49]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[50]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[51]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[52]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[53]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[54]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[55]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[56]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[57]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[58]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[59]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[60]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[61]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[62]}]
set_input_delay -clock CLK  -max 1  [get_ports {node3_d_in[63]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node0_pc_out[31]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[31]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[32]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[33]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[34]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[35]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[36]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[37]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[38]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[39]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[40]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[41]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[42]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[43]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[44]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[45]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[46]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[47]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[48]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[49]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[50]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[51]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[52]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[53]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[54]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[55]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[56]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[57]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[58]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[59]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[60]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[61]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[62]}]
set_output_delay -clock CLK  1  [get_ports {node0_d_out[63]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_out[31]}]
set_output_delay -clock CLK  1  [get_ports node0_memEn]
set_output_delay -clock CLK  1  [get_ports node0_memWrEn]
set_output_delay -clock CLK  1  [get_ports {node0_addr_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node0_addr_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[2]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[3]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[4]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[5]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[6]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[7]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[8]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[9]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[10]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[11]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[12]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[13]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[14]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[15]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[16]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[17]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[18]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[19]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[20]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[21]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[22]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[23]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[24]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[25]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[26]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[27]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[28]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[29]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[30]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[31]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[32]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[33]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[34]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[35]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[36]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[37]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[38]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[39]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[40]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[41]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[42]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[43]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[44]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[45]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[46]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[47]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[48]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[49]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[50]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[51]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[52]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[53]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[54]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[55]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[56]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[57]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[58]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[59]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[60]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[61]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[62]}]
set_output_delay -clock CLK  1  [get_ports {node0_din_nic[63]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[2]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[3]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[4]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[5]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[6]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[7]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[8]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[9]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[10]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[11]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[12]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[13]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[14]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[15]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[16]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[17]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[18]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[19]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[20]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[21]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[22]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[23]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[24]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[25]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[26]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[27]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[28]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[29]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[30]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[31]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[32]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[33]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[34]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[35]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[36]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[37]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[38]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[39]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[40]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[41]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[42]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[43]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[44]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[45]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[46]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[47]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[48]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[49]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[50]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[51]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[52]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[53]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[54]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[55]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[56]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[57]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[58]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[59]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[60]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[61]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[62]}]
set_output_delay -clock CLK  1  [get_ports {node0_dout_nic[63]}]
set_output_delay -clock CLK  1  [get_ports node0_nicEn]
set_output_delay -clock CLK  1  [get_ports node0_nicWrEn]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node1_pc_out[31]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[31]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[32]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[33]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[34]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[35]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[36]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[37]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[38]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[39]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[40]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[41]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[42]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[43]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[44]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[45]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[46]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[47]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[48]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[49]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[50]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[51]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[52]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[53]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[54]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[55]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[56]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[57]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[58]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[59]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[60]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[61]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[62]}]
set_output_delay -clock CLK  1  [get_ports {node1_d_out[63]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_out[31]}]
set_output_delay -clock CLK  1  [get_ports node1_memEn]
set_output_delay -clock CLK  1  [get_ports node1_memWrEn]
set_output_delay -clock CLK  1  [get_ports {node1_addr_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node1_addr_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[2]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[3]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[4]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[5]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[6]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[7]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[8]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[9]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[10]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[11]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[12]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[13]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[14]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[15]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[16]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[17]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[18]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[19]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[20]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[21]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[22]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[23]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[24]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[25]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[26]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[27]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[28]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[29]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[30]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[31]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[32]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[33]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[34]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[35]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[36]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[37]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[38]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[39]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[40]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[41]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[42]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[43]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[44]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[45]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[46]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[47]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[48]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[49]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[50]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[51]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[52]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[53]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[54]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[55]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[56]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[57]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[58]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[59]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[60]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[61]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[62]}]
set_output_delay -clock CLK  1  [get_ports {node1_din_nic[63]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[2]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[3]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[4]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[5]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[6]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[7]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[8]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[9]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[10]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[11]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[12]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[13]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[14]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[15]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[16]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[17]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[18]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[19]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[20]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[21]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[22]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[23]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[24]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[25]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[26]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[27]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[28]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[29]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[30]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[31]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[32]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[33]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[34]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[35]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[36]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[37]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[38]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[39]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[40]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[41]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[42]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[43]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[44]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[45]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[46]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[47]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[48]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[49]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[50]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[51]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[52]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[53]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[54]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[55]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[56]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[57]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[58]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[59]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[60]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[61]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[62]}]
set_output_delay -clock CLK  1  [get_ports {node1_dout_nic[63]}]
set_output_delay -clock CLK  1  [get_ports node1_nicEn]
set_output_delay -clock CLK  1  [get_ports node1_nicWrEn]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node2_pc_out[31]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[31]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[32]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[33]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[34]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[35]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[36]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[37]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[38]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[39]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[40]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[41]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[42]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[43]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[44]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[45]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[46]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[47]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[48]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[49]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[50]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[51]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[52]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[53]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[54]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[55]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[56]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[57]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[58]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[59]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[60]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[61]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[62]}]
set_output_delay -clock CLK  1  [get_ports {node2_d_out[63]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_out[31]}]
set_output_delay -clock CLK  1  [get_ports node2_memEn]
set_output_delay -clock CLK  1  [get_ports node2_memWrEn]
set_output_delay -clock CLK  1  [get_ports {node2_addr_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node2_addr_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[2]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[3]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[4]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[5]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[6]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[7]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[8]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[9]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[10]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[11]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[12]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[13]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[14]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[15]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[16]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[17]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[18]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[19]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[20]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[21]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[22]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[23]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[24]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[25]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[26]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[27]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[28]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[29]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[30]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[31]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[32]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[33]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[34]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[35]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[36]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[37]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[38]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[39]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[40]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[41]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[42]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[43]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[44]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[45]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[46]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[47]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[48]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[49]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[50]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[51]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[52]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[53]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[54]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[55]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[56]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[57]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[58]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[59]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[60]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[61]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[62]}]
set_output_delay -clock CLK  1  [get_ports {node2_din_nic[63]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[2]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[3]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[4]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[5]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[6]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[7]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[8]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[9]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[10]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[11]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[12]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[13]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[14]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[15]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[16]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[17]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[18]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[19]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[20]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[21]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[22]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[23]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[24]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[25]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[26]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[27]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[28]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[29]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[30]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[31]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[32]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[33]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[34]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[35]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[36]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[37]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[38]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[39]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[40]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[41]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[42]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[43]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[44]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[45]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[46]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[47]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[48]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[49]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[50]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[51]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[52]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[53]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[54]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[55]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[56]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[57]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[58]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[59]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[60]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[61]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[62]}]
set_output_delay -clock CLK  1  [get_ports {node2_dout_nic[63]}]
set_output_delay -clock CLK  1  [get_ports node2_nicEn]
set_output_delay -clock CLK  1  [get_ports node2_nicWrEn]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node3_pc_out[31]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[31]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[32]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[33]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[34]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[35]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[36]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[37]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[38]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[39]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[40]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[41]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[42]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[43]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[44]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[45]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[46]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[47]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[48]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[49]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[50]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[51]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[52]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[53]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[54]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[55]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[56]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[57]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[58]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[59]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[60]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[61]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[62]}]
set_output_delay -clock CLK  1  [get_ports {node3_d_out[63]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[0]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[1]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[2]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[3]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[4]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[5]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[6]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[7]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[8]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[9]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[10]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[11]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[12]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[13]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[14]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[15]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[16]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[17]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[18]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[19]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[20]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[21]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[22]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[23]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[24]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[25]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[26]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[27]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[28]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[29]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[30]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_out[31]}]
set_output_delay -clock CLK  1  [get_ports node3_memEn]
set_output_delay -clock CLK  1  [get_ports node3_memWrEn]
set_output_delay -clock CLK  1  [get_ports {node3_addr_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node3_addr_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[2]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[3]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[4]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[5]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[6]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[7]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[8]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[9]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[10]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[11]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[12]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[13]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[14]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[15]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[16]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[17]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[18]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[19]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[20]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[21]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[22]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[23]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[24]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[25]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[26]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[27]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[28]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[29]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[30]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[31]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[32]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[33]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[34]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[35]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[36]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[37]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[38]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[39]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[40]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[41]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[42]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[43]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[44]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[45]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[46]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[47]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[48]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[49]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[50]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[51]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[52]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[53]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[54]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[55]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[56]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[57]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[58]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[59]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[60]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[61]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[62]}]
set_output_delay -clock CLK  1  [get_ports {node3_din_nic[63]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[0]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[1]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[2]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[3]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[4]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[5]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[6]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[7]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[8]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[9]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[10]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[11]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[12]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[13]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[14]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[15]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[16]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[17]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[18]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[19]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[20]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[21]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[22]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[23]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[24]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[25]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[26]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[27]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[28]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[29]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[30]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[31]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[32]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[33]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[34]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[35]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[36]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[37]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[38]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[39]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[40]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[41]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[42]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[43]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[44]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[45]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[46]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[47]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[48]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[49]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[50]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[51]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[52]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[53]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[54]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[55]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[56]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[57]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[58]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[59]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[60]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[61]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[62]}]
set_output_delay -clock CLK  1  [get_ports {node3_dout_nic[63]}]
set_output_delay -clock CLK  1  [get_ports node3_nicEn]
set_output_delay -clock CLK  1  [get_ports node3_nicWrEn]
